package com.file.file;

public class InputSream {
    public static void main(String[] args) {
        /*
          字节输入流
          1、文件输入流
          2、管道输入流
          3、过滤器输入流
            3.1 会压输入流
            3.2 缓冲输入流
            3.3 数据输入流
          4、对象输入流
          5、顺序输入流
          6、字节数组输入流
          7、缓存字符输入流
         */

        /*
           字节输出流
           1、文件输出流
           2、管道输出流
           3、过滤器输出流
             3.1 格式化输出流
             3.2 缓存输出流
             3.3 数据输出流
           4、对象输出流
           5、字节数组输出流
         */

        // 文字的输入流和输出流
        // 字节输入流
        // 字节输出流


    }
}
